OpenFOAM_Maincode/tutorials/incompressibleFluid/cavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    movingWall
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
